# Day 12 Workout - Combining Datasets

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('data/InternetCompanies.csv')
data

            Company Country MarketCap    Cash Revenue
0             Apple     USA     $547    $233    $235
1   Google/Alphabet     USA     $510     $79     $75
2            Amazon     USA     $341     $16    $107
3          Facebook     USA     $340     $21     $18
4           Tencent   China     $206     $14     $16
5           Alibaba   China     $205     $18     $15
6   Priceline Group     USA      $63     $11      $9
7              Uber     USA      $63    $-      $-
8             Baidu   China      $62     $11     $10
9     Ant Financial   China      $60    $-      $-
10       Salesforce     USA      $57      $4      $7
11           Xiaomi   China      $46    $-      $-
12           Paypal     USA      $46      $6      $9
13          Netflix     USA      $44      $2      $7
14            Yahoo     USA      $36     $10      $5
15           JD.com   China      $34      $5     $28
16             eBay     USA      $28     $11      $9
17           Airbnb     USA      $26    $-      $-
18      Yahoo Japan   Japan      $26      $5      $5
19      Didi Kuaidi   China      $25    $-      $-

`data` is broken to two data frames `data1` and `data2`.
Reassemble the data from the two data frames

In [3]:
data1 = data.iloc[:10, :]
data2 = data.iloc[10:, :]

In [1]:
#Solution

`data` is broken to two data frames `data1` and `data2`.
Reassemble the data from the two data frames

In [8]:
data1 = data.iloc[:, :2]
data2 = data.iloc[:, 2:]

In [2]:
#Solution

`data` is broken to four data frames `data1`, `data2`, `data3`, and `data4`.
Reassemble the data from the four data frames

In [12]:
data1 = data.iloc[:10, :2]
data2 = data.iloc[10:, :2]
data3 = data.iloc[:10, 2:]
data4 = data.iloc[10:, 2:]

In [3]:
#Solution

## Merge

The data frames `Customers`, `Employees`, `Offices`, `OrderDetails`, `Orders`, `Payments`, `ProductLines`, and `Products` contain data of the corresponding tables in the [ClassicModels database](https://www.richardtwatson.com/open/Reader/ClassicModels.html).

The entity relationship diagram is shown here:
 
![ERD](ClassicModels.png)

In [41]:
Customers = pd.read_csv('data/ClassicModels_Customers.csv', sep=';')
Employees = pd.read_csv('data/ClassicModels_Employees.csv', sep=';')
Offices = pd.read_csv('data/ClassicModels_Offices.csv', sep=';')
OrderDetails = pd.read_csv('data/ClassicModels_OrderDetails.csv', sep=';')
Orders = pd.read_csv('data/ClassicModels_Orders.csv', sep=';')
Payments = pd.read_csv('data/ClassicModels_Payments.csv', sep=';')
Payments = pd.read_csv('data/ClassicModels_Payments.csv', sep=';')
Products = pd.read_csv('data/ClassicModels_Products.csv', sep=';')
Customers.head()

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit,customerLocation
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",NaN,Nantes,NaN,44000,France,1370,21000.0,0
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,NaN,Las Vegas,NV,83030,USA,1166,71800.0,0
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611,117300.0,0
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",NaN,Nantes,NaN,44000,France,1370,118200.0,0
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,NaN,Stavern,NaN,4110,Norway,1504,81700.0,0

Using Pandas merge and join operations, answer the following questions:

*One to many relationship*

- Report the account representative for each customer.
- Report total payments for Atelier graphique.
- Report the total payments by date
- Report the products that have not been sold.
- List the amount paid by each customer.
- How many orders have been placed by Herkku Gifts?
- Who are the employees in Boston?
- Report those payments greater than \\$100,000. Sort the report so the customer who made the highest payment appears first.
- List the value of 'On Hold' orders.
- Report the number of orders 'On Hold' for each customer.

*Many to many relationship*

- List products sold sorted by order date.
- List the order dates in descending order for orders for the 1940 Ford Pickup Truck.

In [4]:
#Report the account representative for each customer.

In [5]:
#Report total payments for Atelier graphique.

In [6]:
#Report the total payments by date

In [7]:
#Report the products that have not been sold.

In [8]:
#List the amount paid by each customer.

In [9]:
#How many orders have been placed by Herkku Gifts?

In [10]:
#Who are the employees in Boston?

In [11]:
#Report those payments greater than $100,000. 
#Sort the report so the customer who made the highest payment appears first.

In [12]:
#List the value of 'On Hold' orders.

In [13]:
#Report the number of orders 'On Hold' for each customer.

In [14]:
#List products sold sorted by order date.

In [15]:
#List the order dates in descending order for orders for the 1940 Ford Pickup Truck.